12/data/attachments/d3179f41ee535532.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_b9695874-39ad-4393-87dc-b3a171a35a91</nif:username>
            <nif:friendToBeAdded>Christina_guess_Actions_51817_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>